package pro.sky.tgbotcatshelter.constants;

public class Messages {

    public static final String GREETINGS_NEW_USER = """
            Здравствуйте! Я бот-приюта для животных,
            помогу тебе в выборе друга-питомца и получении необходимой информации
            В этом чате я смогу ответить на ваши вопросы 24/7""";
    public static final String GREETINGS_USER = """
            Здравствуйте! С возвращением""";
    public static final String CALL_VOLUNTEER = """
            Вы вызвали волонтера для связи. Волонтер сейчас свяжется с вами.""";
    public static final String CHOSE = """
            Выберите интересующий вас приют:""";
    public static final String SEND_PETS_REPORT = """
            Отлично! Пожалуйста, отправьте ваш отчет о питомце:
            Фотографию,
            Рацион животного,
            Общее самочувствие и привыкание к новому месту,
            Изменение в поведении: отказ от старых привычек, приобретение новых (если есть).""";
    public static final String GET_CONTACT_INFORMATION = """
            Спасибо за ваш запрос! Мы готовы помочь.
            Пожалуйста, предоставьте свои контактные данные (например, номер телефона или email), чтобы наш волонтер мог связаться с вами и предоставить необходимую поддержку.
            Ваши контактные данные будут использованы исключительно для этой цели и не будут раскрываться третьим лицам.""";
    public static final String VOLUNTEER_ALERT = """
            Дорогой усыновитель, мы заметили, что ты заполняешь отчет не так подробно, как необходимо.
            Пожалуйста, подойди ответственнее к этому занятию.
            В противном случае волонтеры приюта будут обязаны самолично проверять условия содержания животного""";
    public static final String GREETINGS_GUEST7 = "";
}
